HenryDisp/steadystate/0/p_rgh.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0.;

boundaryField
{
    left
    {
        type            darcyFixedVelocity;
        velocity        6.6e-5;
        value           uniform  0;
    }

    right
    {
        type            fixedValue;
        value           uniform 0;

    }

    top
    {
        type            darcyFixedVelocity;
        velocity        0;
        value           uniform 0;
    }

    bottom
    {
        type            darcyFixedVelocity;
        velocity        0;
        value           uniform 0;
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }
}


// ************************************************************************* //
